OpenFOAM/foam9tutorials/interfluo/Canonical-Flows/mixing1/mixing_amr_nut/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                             
                     
scale   1;

vertices
(
(0 2 0.0) //0
(0 1 0.0) //1
(0 0 0.0) //2
(4 0 0.0) //3
(4 1 0.0) //4
(4 2 0.0) //5
(0 2 0.5) //6
(0 1 0.5) //7
(0 0 0.5) //8
(4 0 0.5) //9
(4 1 0.5) //10
(4 2 0.5) //11

);

blocks
(
hex (0 1 4 5 6 7 10 11) (10 40 5) simpleGrading (1 1 1)
hex (1 2 3 4 7 8 9 10) (10 40 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	outlet
	{
		type patch;
		faces
		(
			(4 5 11 10)
			(3 4 10 9)
		);
	}

	inlet1
	{
		type patch;
		faces
		(
			(0 1 7 6)
		);
	}

	inlet2
	{
		type patch;
		faces
		(
			(1 2 8 7)
		);
	}

	walls
	{
		type wall;
		faces
		(
			(0 5 11 6)
			(2 3 9 8)
			(0 1 4 5)
			(1 2 3 4)
			(6 7 10 11)
			(7 8 9 10)
		);
	}

);

mergePatchPairs
(
);

// ************************************************************************* //
